nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/System.IO.Ports/sys_io_ser_native_System_IO_Ports_SerialPort.cpp
    // unless the build is configure to use USB CDC, COM1 is being used for VS debug, so it's not available
#if !defined(CONFIG_TINYUSB_CDC_ENABLED) && !defined(CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED)
    if (uart_num == 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }
#endif

    palUart = GetPalUartFromUartNum_sys(uart_num);
    if (palUart == nullptr)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // If driver already installed then clean up first
    // Open/Close/Open without dispose
    if (uart_is_driver_installed(uart_num))
    {
        UninitializePalUart_sys(palUart);
    }

    // call the configure and abort if not OK
    NANOCLR_CHECK_HRESULT(NativeConfig___VOID(stack));

    // alloc buffer memory
    bufferSize = pThis[FIELD___bufferSize].NumericByRef().s4;
    palUart->RxBuffer = (uint8_t *)platform_malloc(bufferSize);

    // sanity check
    if (palUart->RxBuffer == nullptr)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OUT_OF_MEMORY);
    }

    // init buffer
    palUart->RxRingBuffer.Initialize(palUart->RxBuffer, bufferSize);

    // set/reset all the rest
    palUart->UartNum = uart_num;
    palUart->TxOngoingCount = 0;
    palUart->RxBytesToRead = 0;
    palUart->NewLineChar = 0;

    // Install driver
    esp_err = uart_driver_install(
        uart_num,
        // rx_buffer_size
        bufferSize,
        // tx_buffer_size, not buffered
        0,
        // queue_size
        20,
        &(palUart->UartEventQueue),
        ESP_INTR_FLAG_IRAM);
    if (esp_err != ESP_OK)
    {
        ESP_LOGE(TAG, "Failed to install uart driver");
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    NANOCLR_CHECK_HRESULT(NativeConfig___VOID(stack));

    // Get the watch char
    watchChar = (uint8_t)pThis[FIELD___watchChar].NumericByRef().u1;

    // set watch char, if set
    if (watchChar != 0)
    {
        // Enable pattern detection for the serial device
        uart_enable_pattern_det_baud_intr(uart_num, watchChar, 1, 9, 0, 00);
        // Reset the pattern queue length to record at most 10 pattern positions.
        uart_pattern_queue_reset(uart_num, 10);
    }

    // Create a task to handle UART event from ISR
    snprintf(task_name, ARRAYSIZE(task_name), "uart%d_events", uart_num);
    if (xTaskCreate(uart_event_task_sys, task_name, 2048, palUart, 12, &(palUart->UartEventTask)) != pdPASS)
    {
        ESP_LOGE(TAG, "Failed to start UART events task");
        NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
    }

    // Ensure driver gets uninitialized during soft reboot
    HAL_AddSoftRebootHandler(Esp32_Serial_UninitializeAll_sys);

    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::NativeConfig___VOID(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();
    {
        uart_config_t uart_config = {};

        // get a pointer to the managed object instance and check that it's not nullptr
        CLR_RT_HeapBlock *pThis = stack.This();
        FAULT_ON_NULL(pThis);

        // Init clock source (added in IDF 5.x)
        uart_config.source_clk = UART_SCLK_DEFAULT;

        // Get Uart number for serial device
        uart_port_t uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);
        if (uart_num > UART_NUM_MAX || uart_num < 0)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // setup configuration
        // baud rate
        uart_config.baud_rate = (uint32_t)pThis[FIELD___baudRate].NumericByRef().s4;

        // data bits
        switch ((uint16_t)pThis[FIELD___dataBits].NumericByRef().s4)
        {
            case 5:
                uart_config.data_bits = UART_DATA_5_BITS;
                break;

            case 6:
                uart_config.data_bits = UART_DATA_6_BITS;
                break;

            case 7:
                uart_config.data_bits = UART_DATA_7_BITS;
                break;

            case 8:
                uart_config.data_bits = UART_DATA_8_BITS;
                break;

            default:
                NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
        }

        // parity
        switch ((Parity)pThis[FIELD___parity].NumericByRef().s4)
        {
            default:
            case Parity_None:
                uart_config.parity = UART_PARITY_DISABLE;
                break;

            case Parity_Even:
                uart_config.parity = UART_PARITY_EVEN;
                break;

            case Parity_Odd:
                uart_config.parity = UART_PARITY_ODD;
                break;
        }

        // stop bits
        switch ((StopBits)pThis[FIELD___stopBits].NumericByRef().s4)
        {
            default:
            case StopBits_One:
                uart_config.stop_bits = UART_STOP_BITS_1;
                break;

            case StopBits_OnePointFive:
                uart_config.stop_bits = UART_STOP_BITS_1_5;
                break;

            case StopBits_Two:
                uart_config.stop_bits = UART_STOP_BITS_2;
                break;
        }

        uart_config.rx_flow_ctrl_thresh = 120;

        bool EnableXonXoff = false;
        switch ((Handshake)pThis[FIELD___handshake].NumericByRef().s4)
        {
            default:
            case Handshake_None:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
                break;

            case Handshake_RequestToSend:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS;
                uart_config.rx_flow_ctrl_thresh = 122;
                break;

            case Handshake_RequestToSendXOnXOff:
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_RTS;
                uart_config.rx_flow_ctrl_thresh = 122;
                EnableXonXoff = true;
                break;

            case Handshake_XOnXOff:
                EnableXonXoff = true;
                uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
                break;
        }

        bool rs485Mode = ((SerialMode)pThis[FIELD___mode].NumericByRef().s4 == SerialMode_RS485);
        if (rs485Mode)
        {
            // Disable any flow control & Set RS485 half duplex mode
            uart_config.flow_ctrl = UART_HW_FLOWCTRL_DISABLE;
            uart_set_mode(uart_num, UART_MODE_RS485_HALF_DUPLEX);
        }
        else
        {
            // Reset to normal mode
            uart_set_mode(uart_num, UART_MODE_UART);
        }

        // Already Initialised ?
        if (GetPalUartFromUartNum_sys(uart_num)->UartEventTask)
        {
            int errors = 0;

            errors += uart_set_word_length(uart_num, uart_config.data_bits);
            errors += uart_set_baudrate(uart_num, uart_config.baud_rate);
            errors += uart_set_parity(uart_num, uart_config.parity);
            errors += uart_set_stop_bits(uart_num, uart_config.stop_bits);
            errors += uart_set_hw_flow_ctrl(uart_num, uart_config.flow_ctrl, uart_config.rx_flow_ctrl_thresh);
            if (errors)
            {
                ESP_LOGE(TAG, "Failed to set UART parameters configuration");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }
        }
        else
        {
            // First time make sure UART is reset so use uart_param_config.
            // If you call this once driver installed it resets UART and stop events ISR being called.
            if (uart_param_config(uart_num, &uart_config) != ESP_OK)
            {
                ESP_LOGE(TAG, "Failed to set UART parameters configuration");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }

            ////////////////////////////////////////////////////////////////////////////
            // signal level inversion can only be configured when UART is not running //
            ////////////////////////////////////////////////////////////////////////////

            // default is to not invert
            uart_signal_inv_t inversionMmask = UART_SIGNAL_INV_DISABLE;

            // get pointer to PAL UART
            NF_PAL_UART *palUart = GetPalUartFromUartNum_sys(uart_num);
            if (palUart == nullptr)
            {
                NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
            }

            // check if signal levels are to be inverted
            if (palUart->SignalLevelsInverted)
            {
                inversionMmask = (uart_signal_inv_t)(UART_SIGNAL_RXD_INV | UART_SIGNAL_TXD_INV);
            }

