nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/System.IO.Ports/sys_io_ser_native_System_IO_Ports_SerialPort.cpp
            // config signal inversion (or not)
            if (uart_set_line_inverse(uart_num, inversionMmask) != ESP_OK)
            {
                ESP_LOGE(TAG, "Failed to set UART parameters configuration");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }
        }

        if (EnableXonXoff)
        {
            uart_set_sw_flow_ctrl(uart_num, true, 20, 40);
        }

        // Map to currently assigned pins
        int txPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Tx);
        int rxPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rx);
        int rtsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Rts);
        int ctsPin = Esp32_GetMappedDevicePins(DEV_TYPE_SERIAL, uart_num, Esp32SerialPin_Cts);

        // check if TX, RX pins have been previously set
        if (txPin == UART_PIN_NO_CHANGE || rxPin == UART_PIN_NO_CHANGE)
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_PIN_UNAVAILABLE);
        }

        // Don't use RTS/CTS pins if no hardware handshake enabled unless in RS485 mode
        if (rs485Mode)
        {
            ctsPin = UART_PIN_NO_CHANGE; // no need for a CTS pin enabled, just RTS
        }
        else
        {
            if (uart_config.flow_ctrl == UART_HW_FLOWCTRL_DISABLE)
            {
                rtsPin = UART_PIN_NO_CHANGE;
                ctsPin = UART_PIN_NO_CHANGE;
            }
        }

        if (uart_set_pin(uart_num, txPin, rxPin, rtsPin, ctsPin) != ESP_OK)
        {
            ESP_LOGE(TAG, "Failed to set UART pins");
            NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
        }

        // null pointers and vars
        pThis = nullptr;
    }
    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::NativeSetWatchChar___VOID(CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    uart_port_t uart_num;
    uint8_t watchChar;

    // get a pointer to the managed object instance and check that it's not nullptr
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    if (pThis[FIELD___disposed].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }

    // Get Uart number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);

    // Get the watch char
    watchChar = (uint8_t)pThis[FIELD___watchChar].NumericByRef().u1;

    // Enable pattern detection for the serial device
    uart_enable_pattern_det_baud_intr(uart_num, watchChar, 1, 9, 0, 00);
    // Reset the pattern queue length to record at most 10 pattern positions.
    uart_pattern_queue_reset(uart_num, 10);

    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::NativeWriteString___VOID__STRING__BOOLEAN(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    NF_PAL_UART *palUart = nullptr;
    uart_port_t uart_num;

    CLR_RT_HeapBlock hbTimeout;
    int64_t *timeoutTicks;
    bool eventResult = true;

    bool isNewAllocation = false;
    char *buffer = nullptr;
    const char *bufferPointer = nullptr;
    uint32_t bufferLength;
    int32_t length = 0;

    // get a pointer to the managed object instance and check that it's not nullptr
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    if (pThis[FIELD___disposed].NumericByRef().u1 != 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OBJECT_DISPOSED);
    }

    // Get UART number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);

    // get pointer to PAL UART
    palUart = GetPalUartFromUartNum_sys(uart_num);
    if (palUart == nullptr)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    if (stack.Arg1().RecoverString() == nullptr)
    {
        // text string it's empty so there is noting to do here
        stack.SetResult_U4(0);
        NANOCLR_SET_AND_LEAVE(S_OK);
    }

    // perform parameter validation and setup TX operation
    if (stack.m_customState == 0)
    {
        // get buffer to output
        NANOCLR_CHECK_HRESULT(SetupWriteLine(stack, &buffer, &bufferLength, &isNewAllocation));

        // Try to send buffer to fifo first.
        // if not all data written then use long running operation to complete.
        palUart->IsLongRunning = false;

        // store pointer because it will be changed after this call
        bufferPointer = buffer;

        int txCount = uart_tx_chars(uart_num, (const char *)buffer, bufferLength);

        if (txCount < (int)bufferLength)
        {
            palUart->IsLongRunning = true;
            if (txCount >= 0)
            {
                // Any written then update ptr / count
                bufferLength -= txCount;
                bufferPointer += txCount;
            }
        }

        if (palUart->IsLongRunning)
        {
            // setup timeout
            hbTimeout.SetInteger(
                (CLR_INT64)pThis[FIELD___writeTimeout].NumericByRef().s4 * TIME_CONVERSION__TO_MILLISECONDS);
            NANOCLR_CHECK_HRESULT(stack.SetupTimeoutFromTicks(hbTimeout, timeoutTicks));

            // store pointer
            palUart->TxBuffer = (uint8_t *)bufferPointer;

            // set TX count
            palUart->TxOngoingCount = bufferLength;

            // push onto the eval stack how many bytes are being pushed to the UART
            stack.PushValueI4(bufferLength);

            // push onto the eval stack if the buffer was allocated
            stack.PushValueI4(isNewAllocation ? 1 : 0);

            // push buffer pointer to eval stack
            // need this to release the buffer later, because the pointer is changed
            stack.PushValueU4((CLR_UINT32)&bufferPointer);

            // Create a task to handle UART event from ISR
            char task_name[16];
            snprintf(task_name, ARRAYSIZE(task_name), "uart%d_tx", uart_num);

            if (xTaskCreate(UartTxWorkerTask_sys, task_name, 2048, palUart, 12, nullptr) != pdPASS)
            {
                ESP_LOGE(TAG, "Failed to start UART TX task");
                NANOCLR_SET_AND_LEAVE(CLR_E_FAIL);
            }

            // bump custom state so the read value above is pushed only once
            stack.m_customState = 2;
        }
    }

    while (eventResult)
    {
        if (!palUart->IsLongRunning)
        {
            // this is not a long running operation so nothing to do here
            break;
        }

        // non-blocking wait allowing other threads to run while we wait for the TX operation to complete
        NANOCLR_CHECK_HRESULT(
            g_CLR_RT_ExecutionEngine.WaitEvents(stack.m_owningThread, *timeoutTicks, Event_SerialPortOut, eventResult));

        if (eventResult)
        {
            // event occurred

            // pop "buffer pointer" from the eval stack
            buffer = (char *)stack.m_evalStack[3].NumericByRef().u4;

            // pop "isNewAllocation" from the eval stack
            isNewAllocation = stack.m_evalStack[2].NumericByRef().s4 == 1 ? true : false;

            // get from the eval stack how many bytes were buffered to TX
            length = stack.m_evalStack[1].NumericByRef().s4;

            // reset TX ongoing count
            palUart->TxOngoingCount = 0;

            // done here
            break;
        }
        else
        {
            NANOCLR_SET_AND_LEAVE(CLR_E_TIMEOUT);
        }
    }

    if (palUart->IsLongRunning)
    {
        // pop "length" heap block from stack
        stack.PopValue();

        // pop "isNewAllocation" heap block from stack
        stack.PopValue();

        // pop "buffer" heap block from stack
        stack.PopValue();

        // pop "hbTimeout" heap block from stack
        stack.PopValue();
    }

    stack.SetResult_U4(length);

    // free memory, if it was allocated
    if (isNewAllocation && buffer != nullptr)
    {
        platform_free(buffer);
    }

    // null pointers and vars
    pThis = nullptr;

