nanoframework/nf-interpreter/targets/ESP32/_nanoCLR/System.IO.Ports/sys_io_ser_native_System_IO_Ports_SerialPort.cpp
    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::NativeReceivedBytesThreshold___VOID__I4(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    NF_PAL_UART *palUart;
    int32_t threshold;
    uart_port_t uart_num;

    // get a pointer to the managed object instance and check that it's not nullptr
    CLR_RT_HeapBlock *pThis = stack.This();
    FAULT_ON_NULL(pThis);

    // check if threshold is valid
    threshold = (int32_t)stack.Arg1().NumericByRef().s4;

    if (threshold <= 0)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_OUT_OF_RANGE);
    }

    // Get UART number for serial device
    uart_num = (uart_port_t)PORT_INDEX_TO_UART_NUM(pThis[FIELD___portIndex].NumericByRef().s4);

    // get pointer to PAL UART
    palUart = GetPalUartFromUartNum_sys(uart_num);
    if (palUart == nullptr)
    {
        NANOCLR_SET_AND_LEAVE(CLR_E_INVALID_PARAMETER);
    }

    // update field
    pThis[FIELD___receivedBytesThreshold].NumericByRef().s4 = threshold;

    // update threshold value
    palUart->ReceivedBytesThreshold = threshold;

    // fake call to event handler in case port is open and the new threshold was set
    // to a value lower than the bytes that are already available
    if (pThis[FIELD___opened].NumericByRef().u1 && (uint32_t)threshold <= palUart->RxRingBuffer.Length())
    {
        PostManagedEvent(EVENT_SERIAL, 0, UART_NUM_TO_PORT_INDEX(palUart->UartNum), SerialData_Chars);
    }

    NANOCLR_NOCLEANUP();
}

HRESULT Library_sys_io_ser_native_System_IO_Ports_SerialPort::GetDeviceSelector___STATIC__STRING(
    CLR_RT_StackFrame &stack)
{
    NANOCLR_HEADER();

    // declare the device selector string whose max size is "COM1,COM2,COM3" + terminator
    // and init with the terminator
    static char deviceSelectorString[] =

    // unless the build is configure to use USB CDC, COM1 is being used for VS debug, so it's not available
#if defined(CONFIG_TINYUSB_CDC_ENABLED) || defined(CONFIG_ESP_CONSOLE_USB_SERIAL_JTAG_ENABLED)
        "COM1,"
#endif
#if SOC_UART_HP_NUM > 1
        "COM2,"
#endif
#if SOC_UART_HP_NUM > 2
        "COM3,"
#endif
#if SOC_UART_HP_NUM > 3
        "COM4,"
#endif
        ;

    // replace the last comma with a terminator
    if (deviceSelectorString[hal_strlen_s(deviceSelectorString) - 1] == ',')
    {
        deviceSelectorString[hal_strlen_s(deviceSelectorString) - 1] = '\0';
    }

    // because the caller is expecting a result to be returned
    // we need set a return result in the stack argument using the appropriate SetResult according to the variable
    // type (a string here)
    stack.SetResult_String(deviceSelectorString);

    NANOCLR_NOCLEANUP_NOLABEL();
}
